app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "b"], ["description", ""], ["created_at", "2022-09-11 15:05:16.030524"], ["updated_at", "2022-09-11 15:05:16.030524"], ["user_id", 4]]

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "c\r\nhttps://railstutorial.jp/members/login"], ["updated_at", "2022-09-18 16:12:03.365435"], ["id", 11]]

  def destroy
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 11], ["LIMIT", 1]]