app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id])